# AreaTagLineCannotBeInDesignOption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..AreaTagLineCannotBeInDesignOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Areas and Area Boundaries are not allowed in Design Options. Make an Area Scheme and an Area Plan for this Option then draw all Areas and Area Boundaries in that view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AreaTagLineCannotBeInDesignOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaTagLineCannotBeInDesignOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AreaTagLineCannotBeInDesignOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace